cases/hydrodynamic/jetCrossFlow/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (65 0 0);

// NOTE: In this case, the momentum flux ratio q=7.8; the cross-flow Weber number We=144.
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    jetInlet
    {
        type            fixedValue;
        value           uniform (0 6.36 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    yMax
    {
        type            noSlip;
    }

    airBed
    {
        type            noSlip;
    }

    zMinMax
    {
        type            slip;
    }

}


// ************************************************************************* //
