cases/hydrodynamic/jetCrossFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.00;

vertices
(
    (-0.01    0    -0.01)
    (0.03    0    -0.01)
    (0.03   0.02   -0.01)
    (-0.01    0.02   -0.01)
    (-0.01    0    0.01)
    (0.03   0    0.01)
    (0.03   0.02   0.01)
    (-0.01    0.02   0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 100 100) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    inlet
    {
        type    patch;
        faces
        (
            (0 4 7 3) 
        );
    }

    outlet
    {
        type    patch;
        faces
        (
            (2 6 5 1)
        );
    }
   
    zMinMax
    {
        type    patch;
        faces
        (
            (3 2 1 0)
            (4 5 6 7)
        );
    }
    
    yMin
    {
        type    patch;
        faces
        (
            (0 1 5 4)
        );
    }

    yMax
    {
        type    patch;
        faces
        (
            (7 6 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
