cases/hydrodynamic/jetCrossFlow/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "flowBoxGeo/jetCrossFlowBox.fms";

maxCellSize #calc "0.02/64";

/* boundaryCellSize 0.1;

localRefinement
{
    defaultFaces0006
    {
        cellSize 0.01;
    }
    defaultFaces0007
    {
        cellSize 0.005;
    }
    defaultFaces0009
    {
        cellSize 0.005;
    }
}
*/

// ************************************************************************* //
